import { ComponentType, useEffect, useState } from 'react';
import { Link, useLocation } from 'react-router-dom';
import { connect } from 'react-redux';
import { IApplicationState } from '../../store/state';
import { reserveAndRegisterActions } from './Actions/ReserveAndRegister/action';
import { IReserveAndRegisterState } from './Actions/ReserveAndRegister/model';
import NapAlerts from '../../components/general/NapAlerts/NapAlerts';
import '../../components/tamato/promise/ReserveAndRegister.css';

type IProps = typeof reserveAndRegisterActions & IReserveAndRegisterState;

const TamatoPromisePage = (props: IProps) => {
	const [valid, setValid] = useState(false);
	const locationObject = useLocation();
	useEffect(() => {
		props.getIsChechPromise();
	}, []);
	return (
		<>
			<NapAlerts alerts={props.alerts} clearAlerts={() => props.clearAlerts()} />
			<div className='w-full max-w-screen-xl m-auto flex flex-grow-1 confirm-parent promise'>
				<div className='w-full flex justify-center'>
					<strong className='text-danger h6 mb-4'>اینجانب ضمن مطالعه دقیق موارد مطروحه به شرح ذیل متعهد می گردم :</strong>
				</div>
				<ol className={'promise-ul'}>
					<li>
						نسبت به ارایه اصل مدارک جهت تشرف به حج تمتع شامل اصل قبض ودیعه گذاری اولیه هزینه سفر حج، شناسنامه و کارت ملی، گذرنامه
						معتبر دارای ۷ ماه اعتبار از تاریخ پرواز و دارای حداقل 2 صفحه سفید مقابل هم، دو قطعه عکس به کاروان اقدام نمایم.
					</li>
					<li>اطلاع کامل از هزینه سفر حج تمتع را دارم و متعهد به پرداخت آن بصورت کامل می‌باشم. </li>
					<li>
						اطلاع دارم که ارز همراه، عوارض خروج از کشور، معاینات پزشکی قبل از سفر، انجام قربانی، جامه‌دان، لباس و سایر اقلام
						متحدالشکل، هزینه‌های تلفن و اینترنت در ایران و عربستان، حمل اضافه بار، انتقال زائر به فرودگاه‌های داخل کشور، هزینه
						ایاب و ذهاب خارج از برنامه و همچنین سایر هزینه‌های شخصی اعم از ارزی یا ریالی در هزینه سفر پیش‌بینی و محاسبه نگردیده و
						بر عهده اینجانب می باشد.
					</li>
					<li>
						مطلع هستم که مدت زمان پوشش بیمه‌ای اینجانب بر اساس قراردادی است که سازمان با شرکت بیمه منعقد می نماید و پوشش بیمه‌ای
						زائرین و بار همراه در طول مدت قرارداد و به تناسب حق بیمه پرداختی به شرکت بیمه که قبل از سفر از مفاد آن مطلع هستم،
						می‌باشد
					</li>
					<li>
						مطلع میباشم که چنانچه پوشش بیمه‌ای فوق الذکر را کافی ندانم می‌توانم با پرداخت حق بیمه تکمیلی مربوطه از سقف تعهدات
						بیشتری در هر زمینه برخوردار گردم.
					</li>
					<li>
						مطلع می‌باشم که چنانچه پوشش بیمه‌ای فوق‌الذکر را کافی ندانم، می‌توانم با پرداخت حق بیمه تکمیلی مربوطه، از سقف تعهدات
						بیشتری در هر زمینه برخوردار گردم.
					</li>
					<li>
						متعهد به ارائه سایر مدارک و اطلاعات فردی و عمومی مورد نیاز سفر حج در موعد مقرر به کاروان برابر با اطلاعیه‌های سازمان و
						عنداللزوم تکمیل و امضای فرم‌های مربوطه حسب مورد و پرداخت مابه‌التفاوت هزینه‌های سفر در مهلت مقرر می‌باشم و عدم واریز
						مابه التفاوت به منزله انصراف تلقی و شخص دیگری جایگزین اینجانب خواهد شد.
					</li>
					<li>
						متعهد می‌گردم نسبت به مراجعه به پزشک معتمد مرکز پزشکی حج و زیارت در موعد تعیین شده جهت انجام معاینات، واکسیناسیون،
						آزمایش‌های لازم به تشخیص پزشک و ارائه اطلاعات دقیق از وضعیت سلامتی خود و اخذ گواهی استطاعت جسمی و روانی دایر بر اجازه
						سفر به حج تمتع اقدام نموده و ضمناً هزینه‌های پزشکی و آزمایش‌های تکمیلی و تخصصی بر عهده اینجانب خواهد بود. تأکید
						می‌نماید عدم ارائه تأییدیه پزشکی به منزله انصراف از سفر تلقی و شخص دیگری جایگزین خواهد شد.
					</li>
					<li>
						متهعد می‌گردم چنانچه تا قبل از شروع سفر دچار بیماری جسمی و روانی خاصی گردیدم پزشک معتمد و همچنین مدیر کاروان را در
						جریان بیماری خود قرار دهم؛ بدیهی است انجام سفر حج منوط به برخوردار بودن سلامت از جسمی و روانی اینجانب می‌باشد.
					</li>
					<li>
						متعهد می‌گردم که در تمامی جلسات و کلاس‌های آموزشی (قبل و در طی سفر) که جهت توجیه، آموزش و آماده‌سازی اینجانب برای سفر
						حج و انجام اعمال و مناسک توسط کاروان برگزار می‌شود، شرکت کرده و مطالعه دقیق مطالب نشریات و بروشورهای ارائه شده و رعایت
						موضوعاتی که جنبه تعهدی برای اینجانب دارد، الزامی است.
					</li>
					<li>
						متعهد می‌گردم که هماهنگی و همکاری لازم را با مدیر کاروان جهت تعیین هم اتاقی‌های محل اقامت در طی سفر از بین زائرین
						کاروان به تناسب اتاق‌های موجود را داشته باشم.
					</li>
					<li>
						مطلع می‌باشم که داروهای ضروری مورد نیاز (در صورت ابتلا به بیماری خاص) و ممهور نمودن نسخه مربوط به مهر پزشک معالج به
						زبان انگلیسی و با هماهنگی پزشک معرفی شده کاروان را برای حداقل چهل روز به همراه داشته باشم.{' '}
					</li>
					<li>متعهد می‌گردم به موقع در فرودگاه یا محل اعلام شده توسط کاروان جهت عزیمت به فرودگاه حاضر باشم.</li>
					<li>
						مطلع می‌باشم که در صورت عدم رعایت حجاب اسلامی (پوشش چادر برای بانوان) و همچنین عدم رعایت شئونات اخلاقی و تأیید آن از
						سوی افراد مسئول، سازمان حج و زیارت این اختیار را دارد که زائر مورد نظر را در هر مرحله‌ای از سفر به کشور بازگرداند؛ در
						این صورت هیچ گونه حقی برای اینجانب برای تشرف جدید با استفاده از قبض قبلی وجود نخواهد داشت. ضمناً هزینه سفر نیز به
						اینجانب مسترد نخواهد شد.{' '}
					</li>
					<li>
						متعهد می‌گردم که مقررات و قوانین مربوط به سفر حج تمتع که از سوی جمهوری اسلامی ایران و عربستان سعودی وضع شده است را
						رعایت نمایم.{' '}
					</li>
					<li>
						متهعد می‌گردم کارت شناسایی یا مچ بند راهنما در طول سفر که توسط کاروان به اینجانب تحویل می شود را به همراه داشته باشم.
					</li>
					<li>
						مطلع می‌باشم که در صورت تصمیم به انصراف از تشرف به سفر حج تمتع پس از پرداخت مابه‌التفاوت، با اعلام کتبی مراتب انصراف
						به کاروان، تکمیل فرم انصراف و بازگرداندن ارز همراه به بانک عامل، خسارت های احتمالی که طبق دستورالعمل‌های مربوطه از محل
						وجوه پرداخت شده از سوی سازمان حج برداشت خواهد شد و نهایتاً پایدار نمودن قبض ودیعه‌گذاری خود در بانک برای تشرف در سنوات
						بعدی با هماهنگی کاروان اقدام نمایم.
					</li>
					<li>
						ضمن پذیرش ضوابط و دستورالعمل‌های مربوط به بار و اضافه بار و تعهد در خصوص پایبندی به آن مطلع هستم که بار زائرین تابع
						مقررات شرکت های هواپیمایی طرف قرارداد بوده و در این زمینه سازمان هیچگونه دخل و تصرفی نداشته و صرفاً ابعاد چمدان را به
						زایرین اعلام خواهد شد که رعایت آن به عهده زائرین خواهد بود. بدیهی است چنانچه بیش از دو چمدان مصوب ذکر شده(هر بسته 20
						کیلوگرم) داشته باشم به شرط آن که در ردیف بارهای ممنوعه نباشد، می‌بایست به ازاء هر کیلو بار اضافی مبلغی را پرداخت
						نمایم. شایان ذکر است شرکت‌های هواپیمایی تعهدی نسبت به حمل به موقع بارهای اضافی نداشته و از پذیرش بارهای غیر استاندارد
						و حجیم خودداری خواهند نمود. همچنین بر اساس قوانین بین‌المللی و به منظور حفظ ایمنی پرواز، حمل هرگونه گالن آب به داخل
						هواپیما ممنوع می‌باشد{' '}
					</li>
					<li>
						با توجه به دستورالعمل جدید فرودگاه‌های عربستان، زائران می‌بایست شخصاً بار خود را به باجه پذیرش تحویل و رسید(تگ‌بار)
						دریافت نمایند و چنانچه در مقصد، بار تحویل اینجانب نگردد شخصا فرم مربوط به عدم وجود بار و یا مفقودی را در فرودگاه تکمیل
						و رسید آن را دریافت نمایم و سازمان در این خصوص مسئولیتی ندارد.
					</li>
					<li>
						مطلع میباشم که در صورت ارتکاب اعمال مجرمانه در عربستان سعودی ، سازمان در بازگرداندن اینجانب به کشور مجاز میباشد. ضمنا
						چنانچه توسط کشور میزبان بازداشت شوم هزینه بلیط برگشت و نیز جرائم احتمالی با اینجانب خواهد بود و در این خصوص حق هیچگونه
						اعتراضی را نخواهم داشت.
					</li>
					<li>
						متعهد می‌شوم از ابتدا تا پایان سفر به همراه کاروان بوده و به هیچ وجه به صورت انفرادی به مکه ، مدینه و جده و ... تردد
						ننمایم و کلیه ترددهایم به همراه کاروان باشد ضمن اینکه ورود اینجانب به عربستان و خروج از آنجا خارج از برنامه کاروان به
						هیچ عنوان امکان‌پذیر نخواهد بود.
					</li>
					<li>
						مطلع میباشم که وفق قوانین اخیر عربستان سعودی کلیه زائرانی که قبلاً سابقه تشرف به حج تمتع و عمره مفرده را داشته اند
						مشمول پرداخت مبلغ دو هزار ریال سعودی به عنوان عوارض ورود به کشور میزبان خواهند بود . بدیهی است چنانچه مشمول این بند
						گردم پرداخت وجه مذکور بر عهده خودم می باشد که به صورت جداگانه قبل از پرواز از پرداخت خواهم نمود.
					</li>
					<li>
						مطلع می باشم که طبق قوانین گمرکی کشور میزبان، سقف وجوه نقد همراه زائر مبلغ ۵ هزار دلار یا معادل ریال سعودی آن بوده و
						متعهد به رعایت آن میباشم.
					</li>
					<li>
						مطلع میباشم که در صورت ایراد هرگونه خسارت از سوی اینجانب به اموال هتل ، سرویس های حمل و نقل و سایر خسارات احتمالی ،
						مسئولیت جبران خسارات وارده بر عهده اینجانب خواهد بود.
					</li>
					<li>
						مطلع میباشم که در صورت ایراد هرگونه خسارت از سوی اینجانب به اموال هتل ، سرویس های حمل و نقل و سایر خسارات احتمالی ،
						مسئولیت جبران خسارات وارده بر عهده اینجانب خواهد بود.
					</li>
					<li>
						در صورت بروز هر یک از موارد زیر کاروان می تواند با هماهنگی و موافقت مدیریت حج و زیارت استان نسبت به حذف اینجانب از
						فهرست کاروان اقدام نماید.
					</li>
					<li>عدم مراجعه اینجانب در مهلت مقرر برای قطعی نمودن ثبت نام( بعد از رزرواسیون اولیه )</li>
					<li>عدم مراجعه اینجانب در مهلت مقرر به پزشک معرفی شده از سوی کاروان</li>
					<li>عدم واریز مابه التفاوت هزینه سفر در مهلت تعیین شده .</li>
					<li>عدم ارائه گذرنامه معتبر در مهلت اعلام شده از سوی کاروان.</li>
					<li>
						مطلع می باشم که وجوه نقد، اوراق بهادار، مدارک شناسایی ،طلا و جواهرات و سایر سنگهای قیمتی و زینتی، گوشی تلفن همراه
						،سمعک ،عینک آفتابی و طبی، ویلچر، تجهیزات پزشکی ،دندان مصنوعی، خودکار و خودنویس، دارو و مواد غذایی ،ساعت ،انگشتر ،عطر و
						ادکلن، اکو و آمپلی فایر و بلندگو، لپ تاپ و تبلت و تجهیزات جانبی آنها، فلش مموری و هارد اکسترنال ، ام پی تری پلیر و
						موارد مشابه آن، کالسکه و هر آنچه عنوان بار به آن اطلاق نگردد مشمول پوشش بیمه ای نمی باشد .
					</li>
					<li>مطلع میباشم که از روز پنجم تا سیزدهم ذی الحجه سرویس های حمل و نقل درون شهری در مکه مکرمه تعطیل میباشد.</li>
					<li>
						تامین محل اسکان زائر در مدینه منوره و مکه مکرمه بر اساس گروه قیمتی انتخاب شده توسط اینجانب بوده و مطلع میباشم که هتل
						ها با توجه به کیفیت و موقعیت جغرافیایی گروه قیمتی متفاوت خواهند بود که بر حسب هماهنگی به عمل آمده سرانه فضای اشغال
						اتاق در مکه مکرمه و مدینه منوره حدوداً برای هر نفر ۴ متر مربع تعیین شده است و زایرین بر اساس شرایط مربوطه در اتاق های
						دارای سه تا پنج تخته اسکان خواهد یافت. ضمنا سرانه هر زائر در مشاعر مقدسه (عرفات و منا ) نیز پس از تعیین و جانمایی دقیق
						مشخص خواهد شد.
					</li>
					<li>
						مطلع می باشم که درجه بندی هتل ها با توجه به مقررات کشور عربستان بوده که قبل از عزیمت به اطلاع زائر رسانده خواهد شد.
					</li>
					<li>
						مطلع می باشم که در سفر حج تمتع اتاق های آقایان و بانوان در مکه جدا از یکدیگر می باشد لکن در مدینه بر اساس گروه قیمتی
						کاروان اقدام خواهد شد
					</li>
					<li>مطلع میباشم که تأمین وعده های غذایی صبحانه ،ناهار، شام زایر در آشپزخانه‌های متمرکز طبخ می‌گردد.</li>
					<li>
						مطلع میباشم علیرغم اینکه برنامه‌ریزی جامعی به منظور اجرای دقیق تمامی مراحل اجرایی حج تمتع انجام شده است و به خواست
						خداوند متعال و با تلاش و همت تمامی دست اندرکاران حج تمتع طبق برنامه انجام خواهد شد، با این حال ممکن است عواملی خارج از
						اراده و حوزه اختیارات و کنترل سازمان حج و زیارت و شرکت های مجری حج تمتع از جمله بحران‌های منطقه‌ای و پیامدهای ناشی از
						آن ، بر برخی از برنامه‌ها تأثیر هر چند ناچیز داشته باشد بنابراین سازمان حج و زیارت می‌تواند با توجه به شرایط پیش آمده
						از قبیل موارد ذیل نسبت به تغییر برنامه های اعزام و موارد دیگر اقدام نماید.
					</li>
					احتمال عدم امکان پرواز از ایستگاه پروازی مورد نظر و انتقال ناگزیر زایر به ایستگاه‌های مجاور پروازی.
					<li>احتمال طولانی تر شدن زمان پرواز به دلیل ایجاد امنیت پروازی.</li>
					<li>احتمال ایجاد وقفه، تغییرات و یا تاخیر در عملیات اعزام یا انجام پروازها.</li>
					<li>احتمال تغییر هتل محل اقامت و گروه قیمتی کاروان و نیز احتمال تغییر در مدت اقامت زائر در مکه و مدینه.</li>
					<li>احتمال ایجاد اختلال در روند صدور روادید و در نتیجه تغییر جداول زمانبندی پروازها و اعزام زائر.</li>
					<li>
						احتمال عدم امکان انجام پرواز به مقصد ذکر شده در ابتدای سفر و تغییر مقصد از مدینه به جده و یا بالعکس از مبادی
						ایستگاههای پروازی عربستان به مقاصد و ایستگاههای پروازی ایران.
					</li>
					<li>
						متعهد می گردم که در صورتی که در هر مرحله از ثبت‌نام و اعزام ، عدم اولویت یا وجود اشکال در قبض اینجانب اثبات گردد،
						ثبت‌نام و اعزام اینجانب کان لم یکن تلقی شده و اینجانب متعهد به جبران کلیه خسارات مربوطه می باشم.
					</li>
					<li>
						مطلع می باشم که چنانچه در هنگام عزیمت به عربستان، به هر دلیلی از جمله ممنوع الخروج بودن از پرواز جا بمانم تمام
						مسئولیت، عواقب و خسارات احتمالی مترتب بر آن صرفاً متوجه اینجانب خواهد بود.
					</li>
					<li>
						مطلع میباشم که بعد از اخذ روادید برای زائر، امکان جابجایی و انتقال به سایر کاروان‌ها وجود ندارد، همچنین تغییر در زمان
						عزیمت (تعجیل یا تاخیر در رفت و یا برگشت) به عربستان نیز امکان پذیر نبوده و می بایست صرفاً با کاروان خود عزیمت نموده و
						به کشور بازگردم.
					</li>
					<li>
						مطلع میباشم که امکان اقامت بیش از برنامه زمانی تعیین شده در شهرهای مکه و مدینه برای زایر وجود ندارد. لذا همراهی
						اینجانب با کاروان در همه مراحل سفر خصوصاً در زمان عزیمت به مکه و مدینه و فرودگاه لازم و ضروری است.
					</li>
					<li>
						مطلع میباشم که طول مدت اقامت زائران عربستان جهت انجام فریضه حج از 29 روز تا ۴1 روز بر اساس شرایط و برنامه ریزی های
						سازمان حج و زیارت متغیر خواهد بود.
					</li>
					<li>
						بر اساس جداول پروازی، همواره احتمال عزیمت دو مرحله ای کاروان در دو پرواز جداگانه به عربستان و یا هنگام بازگشت به کشور
						و دو قسمت شدن پرواز کاروان، وجود دارد که در این صورت مطلع میباشم که در این خصوص همکاری لازم را با مدیر کاروان داشته
						باشم.
					</li>
					<li>
						مطلع میباشم که به منظور بازگشت به موقع حجاج به کشور و جلوگیری از طولانی شدن سفر، این احتمال وجود دارد که متناسب با
						شرایط و محدودیت های کشور میزبان، مبدا ایستگاه پروازی برگشت از مدینه به جده و طائف و یا بالعکس تغییر یابد.
					</li>
					<li>
						متعهد می گردم که با کاروان برای حضور در میقات ، انجام عمره تمتع و حضور در مشاعر مقدسه عرفات ، مشعر الحرام و منا همراهی
						نمایم .
					</li>
					<li>
						مطلع میباشم که در صورتی که اینجانب دارای بیماری خاص اعم از جسمی، روحی و روانی بوده و امکان درمان یا نگهداری اینجانب در
						عربستان مقدور نباشد، سازمان حج و زیارت اختیار دارد اینجانب را در هر مرحله از سفر به کشور بازگرداند و مسئولیت دیگری
						متوجه سازمان نخواهد بود و به هر حال تشرف مجدد اینجانب منوط به پرداخت مجدد هزینه سفر در سال های آتی خواهد بود.
					</li>
					<li>
						مطلع میباشم که در طول سفر حج تمتع حق مطالبه گذرنامه از کاروان را نداشته و گذرنامه صرفاً در مبادی خروج و ورود به کشور و
						همچنین مبادی ورود و خروج از کشور میزبان و برای انجام تشریفات اداری در اختیار زائران قرار خواهد گرفت.
					</li>
					<li>
						مطلع و آگاه میباشم که نگهداری و حمل مواد مخدر و مصرف آن به موجب قوانین جمهوری اسلامی ایران و عربستان سعودی ممنوع می
						باشد، چنانچه از زائری مواد مخدر کشف شود یا به تشخیص پزشک معتمد حج و زیارت، ابتلای وی به مواد مخدر احراز گردد، سازمان
						حج و زیارت می تواند اجرای تعهدات خود در قبال زائر به ویژه اعزام وی را بدواً به حالت تعلیق درآورده و عنداللزوم و بدون
						آن که نیازمند به مراجعه به مقامات قضایی باشد اقدامات لازم را جهت ابطال ویزای زیارتی وی به عمل آورد و از این بابت زائر
						هیچگونه ادعایی نداشته و حق هرگونه اعتراضی را از خود سلب و ساقط می نماید و سازمان حق دارد کلیه خسارات ناشی از عدم تشرف
						زائر را به تشخیص خود از محل وجوه پرداختی وی برداشت نماید.
					</li>
					<li className='mb-4'>
						مطلع میباشم که با توجه به ممنوعیت حمل داروهای جایگزین مواد مخدر مانند قرص و شربت متادون در کشور عربستان، زائر اجازه
						حمل این داروها را نداشته و در صورت کشف آن در مبادی خروجی کشور و عدم ارائه مجوز پزشکی و یا تأییدیه مراکز ترک اعتیاد دال
						بر مصرف آن، امکان اعزام اینجانب میسر نبوده و با اینجانب همانند حاملین مواد مخدر برخورد خواهد شد.
					</li>
				</ol>
				<div className={'promise-footer'}>
					<div className={`promise-footer`}>
						{!props.isChechPromise.data ? (
							<>
								<div className={'promise-footer-action'}>
									<input className='checkBoxTailwind' name={'promise'} type={'checkbox'} onClick={() => setValid(!valid)} />
									<label form={'promise'}>قوانین را مطالعه نمودم</label>
								</div>
								<button
									onClick={() => props.createSignUnderTaking()}
									className={`${valid ? '' : 'disable'} btn btn-md btn-primary`}>
									ثبت
								</button>
							</>
						) : (
							''
						)}
						<Link
							to={
								locationObject.state && locationObject.state.returnToDocs
									? '/tamato/my-documents'
									: '/tamato/payment-confirmation'
							}
							className={`btn btn-md btn-outline-primary`}>
							بازگشت
						</Link>
					</div>
				</div>
			</div>
		</>
	);
};
export default connect(
	(state: IApplicationState) => state.reserveAndRegister,
	reserveAndRegisterActions
)(TamatoPromisePage as ComponentType<any>);
