import '../../components/tamato/aboutUs/callCompleteInformations.css';

const TamatoAboutUsPage = () => {
	return (
		<>
			<div className={'box-countainer panel-full complete-information-panel panel-right flex flex-col flex-shrink-0'}>
				<div>
					<h4 className={'box-title'}>درباره ما</h4>
					<div className={'box-info popular-questions border-style-bottom'}>
						<h3>معرفی سازمان حج و زیارت</h3>
						<p>
							سازمان حج و زیارت یک «سازمان دولتی مستقل» و وابسته به وزارت فرهنگ و ارشاد اسلامی است که مسئولیت اجرا و نظارت بر
							سفرهای زیارتی حج تمتع، عمره مفرده و زیارت عتبات عالیات عراق و سوریه را بر عهده دارد.
						</p>
					</div>
					<div className={'box-info popular-questions border-style-bottom'}>
						<h3>اهداف كلي سازمان</h3>
						<p>
							سياست‌گذاري، نظارت، هدايت و اداره امور حج و زيارت عتبات عاليات و برقراري ارتباط با كشورهاي اسلامي و مجامع بين المللي
							اسلامي در امر حج و زيارت و شناساندن ماهيت و ابعاد مختلف حج به حجاج
						</p>
					</div>
					<div className={'list-group'}>
						<ul>
							<h3 className={'ul-title'}>وظايف سازمان</h3>
							<li>اجراي كليه دستورات و ارشادات مقام معظم رهبري</li>
							<li>
								تهيه و تدوين برنامه‌هاي راهبردي، سياست‌ها، خط‌ مشي‌ها و روش هاي اجرايي حج و زيارت جهت ارايه به شوراي عالي حج و
								ساير مراجع ذيربط
							</li>
							<li>
								اداره امور حج عمره و زيارت عتبات مقدس و اماكن متبركه با استفاده از نيروي انساني متدين و كارآزموده و بهره‌گيري از
								آخرين فناوري‌هاي اطلاعات
							</li>
							<li>
								انجام پژوهش و اطلاع‌رساني پيرامون مسائل فرهنگي، اجتماعي، خدماتي، رفاهي و ساير امور مربوط به حج و زيارت و نيز
								نظرسنجي از زايران و ارزشيابي و ارزيابي عملكرد سازمان‌ها، نهادها و بخش‌هاي مختلف دولتي و غيردولتي مشمول و تهيه
								گزارش‌هاي لازم براي ارايه به مراجع ذيربط
							</li>
							<li>ايجاد ارتباط و هماهنگي با سازمان‌ها، دستگاه‌ها و نهادهاي مسؤول در امور حج و زيارت</li>
							<li>
								برنامه‌ ريزي و اقدام در جهت ارتقاي سطح مهارت، دانش و بصيرت ديني كارگزاران حج و زيارت به ويژه، مسؤولان كاروان‌ها و
								راهنمايان و نيز رسيدگي و نظارت بر امور مربوط به عملكرد آنان
							</li>
							<li>
								بررسي، صدور و لغو مجوز فعاليت دفاتر خدمات زيارتي و كاروان‌هاي حج تمتع براساس دستورالعمل‌هاي مربوطه و برخورد قانوني
								با افراد حقيقي و حقوقي غيرمجاز كه خارج از ضوابط سازمان حج و زيارت عمل مي‌كنند
							</li>
							<li>
								اهتمام براي حفظ عزت و منزلت و حقوق زايران ايراني در خارج از كشور و اقدام لازم در مورد شكايات و اجراي مصوبات شوراي
								عالي حج و زيارت و ساير مراجع قانوني
							</li>

							<li>نظارت بر حسن اجراي برنامه‌هاي زيارتي در كشورهاي عربستان سعودي، عراق و سوريه</li>
							<li>
								ايجاد ارتباط با مقامات ذيربط كشورهاي عربستان سعودي، عراق و سوريه با همكاري و هماهنگي نمايندگي‌هاي وزارت امور خارجه
								در كشورهاي مذكور به منظور پيگيري مسائل و مشكلات حجاج و زايران ايراني
							</li>
							<li>سازماندهي امور مربوط به زايران ايراني مقيم خارج از كشور و نظارت بر حسن اجراي آن</li>
							<li>برنامه‌ريزي براي گسترش و تنوع خدمات بيمه و بهداشت و درمان حجاج و زايران</li>
							<li>مطالعه و بررسي راه‌كارهاي استفاده از منابع و امكانات بخش غيردولتي در زمينه‌هاي حج و زيارت</li>
							<li>انجام ساير وظايفي كه به موجب قوانين و مقررات برعهده سازمان قرار گرفته و يا خواهد گرفت</li>
						</ul>
						<ul>
							<h3 className={'ul-title'}>اركان سازمان</h3>
							<li>شوراي عالي حج و زيارت</li>
							<li>نمايندگي ولي فقيه در امور حج و زيارت</li>
							<li>رئيس سازمان حج و زيارت</li>
							<li>حسابرسان</li>
						</ul>
						<ul>
							<h3 className={'ul-title'}>ارتباط با ما</h3>
							<li>آدرس : تهران، خیابان آزادی، نبش خیابان رودکی شمالی ، سازمان حج و زیارت</li>
							<li>تلفن : 02164511</li>
							<li>پست الکترونیکی : info@haj.ir</li>
						</ul>
					</div>
				</div>
			</div>
		</>
	);
};

export default TamatoAboutUsPage;
