import React from 'react';
import { IFaqData } from '../typs/faq.types';

export const mainFaqData: IFaqData[] = [
	{
		category: 'ثبت نام زائران عتبات عالیات در کاروان های زیارتی',
		questions: [
			{
				id: 0,
				question: 'نحوه اطلاع رسانی از زمان ثبت نام دوره جدید عتبات عالیات چگونه می باشد؟',
				answer: (
					<div>
						<p>
							از طریق رسانه های جمعی مانند صدا وسیمای جمهوری اسلامی ایران و سایت اطلاع رسانی سازمان حج و زیارت به آدرس
							<a href='http://www.hajnews.ir' target='_blank' rel='noreferrer'>
								http://www.hajnews.ir
							</a>
						</p>
					</div>
				)
			},
			{
				id: 1,
				question: 'نحوه ثبت نام در کاروانهای اعلامی عتبات عالیات به چه طریقی می باشد؟',
				answer: (
					<div>
						<p>
							در صورتیکه دوره اعزام کاروانهای عتبات در ایام خاص همانند تعطیلات نوروز و ماههای محرم و صفر باشد سازمان حج و زیارت
							برای حفظ سهولت و عدالت برای جلوگیری از ازدحام اقدام به پیش ثبت نام اینترنتی در آدرس
							<a href='http://atabat.haj.ir' target='_blank' rel='noreferrer'>
								http://atabat.haj.ir
							</a>
							می نماید. بدیهی است سامانه مذکور در ایام دیگر سال مورد بهره برداری قرار نمی گیرد. پس از پیش ثبت نام در سامانه مذکور
							در صورت وجود متقاضیان ، بیشتر از ظرفیت اعزامی دوره جاری ، سازمان اقدام به قرعه کشی نموده و اولویت بندی جهت مراجعه
							برای انتخاب کاروانهای موجود را از طریق سامانه فوق‌الذکر فراهم می گردد.
						</p>
						<p>
							در ایامی که متقاضی سفر به عتبات عالیات کمتر باشد، متقاضیان محترم می بایست با مراجعه به دفاتر زیارتی سازمان حج و
							زیارت (کارگزاران سازمان حج و زیارت) و یا متقاضیان محترم با مراجعه به آدرس اینترنتی سامانه ثبت نام عتبات عالیات
							<a href='https://atabatorg.haj.ir' target='_blank' rel='noreferrer'>
								https://atabatorg.haj.ir
							</a>
							اقدام به ایجاد نام کاربری و پس از ورود به سامانه اقدام به ثبت نام در کاروان مورد نظر نمایند.
						</p>
					</div>
				)
			},
			{
				id: 2,
				question: 'نحوه اطلاع از آدرس و مشخصات دفاتر زیارتی فعال دارای مجوز از سازمان حج و زیارت به چه طریقی می باشد ؟',
				answer: (
					<div>
						<p>
							زائرین گــــرامی جهت اطلاع از آدرس و تلفـــــن دفــــاتر زیارتی دارای مـــــجوز رســـــــمی از ســـــازمان حــــــج
							و زیارت می‌توانند به آدرس اینترنتی
							<a href='https://kargozaran.haj.ir/OfficeRelated/SearchOfficePublic.aspx' target='_blank' rel='noreferrer'>
								https://kargozaran.haj.ir/OfficeRelated/SearchOfficePublic.aspx
							</a>
							مراجعه نمایند.
						</p>
					</div>
				)
			},
			{
				id: 3,
				question: 'نحوه پرداخت هزینه سفر به چه طریقی می باشد ؟',
				answer: (
					<div>
						<p>
							زائرین محترم می توانند با دریافت فیش نقدی چاپ شده از دفاتر زیارتی و مراجعه به بانک عامل مربوطه نسبت به پرداخت هزینه
							سفر اقدام نمایند. ضمنا در صورت ثبت نام زائرین محترم از طریق اینترنت امکان پرداخت الکترونیک از طریق درگاه پرداخت
							الکترونیک برای زائرین فراهم می باشد.
						</p>
					</div>
				)
			},
			{
				id: 4,
				question: 'چه مدارکی می‌بایست زائرین محترم جهت اعزام به عتبات عالیات، به دفاتر زیارتی تحویل دهند؟',
				answer: (
					<div>
						<p>
							مدارک مورد نیاز برای اعزام به عتبات عالیات 2 قطعه عکس 4*6 پرسنلی و گذرنامه با حداقل 6 ماه فرصت انقضاء تا تاریخ اعزام
							می باشد.
						</p>
					</div>
				)
			},
			{
				id: 5,
				question: 'نحوه انصراف از سفر توسط زائرین به جه نحوی می باشد ؟',
				answer: (
					<div>
						<p>
							در صورت گذشت 48 ساعت از ثبت نام و عدم واریز هزینه سفر توسط زائر، سامانه به صورت خودکار اقدام به حذف زائر مربوطه
							می‌نماید. در صورتیکه زائر مزبور هزینه سفر خود را به حساب متمرکز وجوه عتبات عالیات واریز نموده باشند، با مراجعه به
							دفتر زیارتی عامل و تایید انصراف نسبت به دریافت کد کنترلی برای برگشت وجه واریزی با کسر خسارت وارده شده، اقدام
							می‌نماید و پس از دریافت کد کنترلی به یکی از شعب بانک مراجعه و وجه خود را دریافت می‌نماید.
						</p>
					</div>
				)
			},
			{
				id: 6,
				question: 'نحوه استفاده متقاضیان از تسهیلات اعزام به عتبات با استفاده از ودیعه ثبت نام عمره خویش، چگونه می باشد؟',
				answer: (
					<div>
						<p>
							متقاضیان محترم می‌بایست در صورت دارا بودن ثبت نام عمره با مراجعه به دفاتر زیارتی و یا از طریق ثبت نام اینترنتی در
							هنگام ثبت نام گزینه "مایل به استفاده از تسهیلات می باشم" را انتخاب نمایند و شماره ثبت نام ودیعه عمره درخواستی توسط
							سامانه را وارد نمایند و سپس با دریافت فیش واریز هزینه سفر به بانک مربوطه مراجعه و پس از دریافت تسهیلات، هزینه سفر را
							با حساب تجمیع وجوه عتبات واریز نمایند.
						</p>
					</div>
				)
			},
			{
				id: 7,
				question: 'اختلاف هزینه سفر در گروه های اعزامی عتبات برای چیست؟',
				answer: (
					<div>
						<p>
							نحوه اعزام زائرین به عراق به صورت زمینی و هوایی میباشد که قیمت بالاتر اعزامهای هوایی بدلیل بلیط هواپیما میباشد. گروه
							قیمتی هتل محل اسکان و مدت اقامت زائرین نیز از پارامترهای تاثیر گذار در تعیین قیمت است.
						</p>
					</div>
				)
			},
			{
				id: 8,
				question: 'علت پایین تر بودن قیمت کاروانهای غیر مجاز چیست؟',
				answer: (
					<div>
						<p>
							کاروانهایی که خارج از پوشش سازمان حج و زیارت اعزام میشوند برای کاهش قیمت از خدماتی مانند امنیت ، بیمه ، تغذیه ،
							استاندارد بودن محل اسکان چشم پوشی نموده که بعضا مشکلات عدیده ای را برای زائرین ایجاد می نماید.
						</p>
					</div>
				)
			},
			{
				id: 9,
				question: 'برنامه اقامت زائرین به چه صورت است ؟',
				answer: (
					<div>
						<table className='table'>
							<thead className='thead-dark'>
								<tr>
									<th scope='col'>برنامه اقامت کاروانها</th>
									<th scope='col'>شب اول</th>
									<th scope='col'>شب دوم</th>
									<th scope='col'>شب سوم</th>
									<th scope='col'>شب چهارم</th>
									<th scope='col'>شب پنجم</th>
									<th scope='col'>شب ششم</th>
									<th scope='col'>شب هفتم</th>
									<th scope='col'>شب هشتم</th>
									<th scope='col'>شب نهم</th>
								</tr>
							</thead>
							<tbody>
								<tr>
									<th scope='row'>هوایی (نجف - بغداد) سامرا</th>
									<td>نجف</td>
									<td>نجف</td>
									<td>نجف</td>
									<td>کربلا</td>
									<td>کربلا</td>
									<td>کربلا</td>
									<td>زیارت سامرا/ اقامت کاظمین</td>
									<td>-</td>
									<td>-</td>
								</tr>
								<tr>
									<th scope='row'>هوایی (نجف - نجف) عادی / سامرا</th>
									<td>نجف</td>
									<td>نجف</td>
									<td>نجف</td>
									<td>کربلا</td>
									<td>کربلا</td>
									<td>کربلا</td>
									<td>زیارت سامرا/ اقامت کاظمین</td>
									<td>-</td>
									<td>-</td>
								</tr>
								<tr>
									<th scope='row'>هوایی (بغداد - بغداد) عادی / سامرا</th>
									<td>نجف</td>
									<td>نجف</td>
									<td>نجف</td>
									<td>کربلا</td>
									<td>کربلا</td>
									<td>کربلا</td>
									<td>زیارت سامرا/ اقامت کاظمین</td>
									<td>-</td>
									<td>-</td>
								</tr>
								<tr>
									<th scope='row'>هوایی (نجف - نجف) عکسی / سامرا</th>
									<td>کاظمین</td>
									<td>زیارت سامرا/ اقامت کربلا</td>
									<td>کربلا</td>
									<td>کربلا</td>
									<td>نجف</td>
									<td>نجف</td>
									<td>نجف</td>
									<td>-</td>
									<td>-</td>
								</tr>
								<tr>
									<th scope='row'>هوایی ( بغداد - نجف ) سامرا</th>
									<td>کاظمین</td>
									<td>زیارت سامرا/ اقامت کربلا</td>
									<td>کربلا</td>
									<td>کربلا</td>
									<td>نجف</td>
									<td>نجف</td>
									<td>نجف</td>
									<td>-</td>
									<td>-</td>
								</tr>
								<tr>
									<th scope='row'>هوایی (بغداد - بغداد) عکسی / سامرا</th>
									<td>کاظمین</td>
									<td>زیارت سامرا/ اقامت کربلا</td>
									<td>کربلا</td>
									<td>کربلا</td>
									<td>نجف</td>
									<td>نجف</td>
									<td>نجف</td>
									<td>-</td>
									<td>-</td>
								</tr>
								<tr>
									<th scope='row'>زمینی ( پنج شب) عادی/ سامرا</th>
									<td>نجف</td>
									<td>نجف</td>
									<td>کربلا</td>
									<td>کربلا</td>
									<td>زیارت سامرا/ اقامت کاظمین</td>
									<td>-</td>
									<td>-</td>
									<td>-</td>
									<td>-</td>
								</tr>
								<tr>
									<th scope='row'>زمینی ( شش شب) عادی</th>
									<td>نجف</td>
									<td>نجف</td>
									<td>نجف</td>
									<td>کربلا</td>
									<td>کربلا</td>
									<td>کربلا</td>
									<td>زیارت عبوری کاظمین/ حرکت به طرف مرز</td>
									<td>-</td>
									<td>-</td>
								</tr>
								<tr>
									<th scope='row'>زمینی ( هفت شب) عادی/ سامرا</th>
									<td>نجف</td>
									<td>نجف</td>
									<td>نجف</td>
									<td>کربلا</td>
									<td>کربلا</td>
									<td>کربلا</td>
									<td>زیارت سامرا/ اقامت کاظمین</td>
									<td>-</td>
									<td>-</td>
								</tr>
								<tr>
									<th scope='row'>زمینی ( هشت شب) عادی/ سامرا</th>
									<td>نجف</td>
									<td>نجف</td>
									<td>نجف</td>
									<td>کربلا</td>
									<td>کربلا</td>
									<td>کربلا</td>
									<td>کربلا</td>
									<td>زیارت سامرا/ اقامت کاظمین</td>
									<td>-</td>
								</tr>
								<tr>
									<th scope='row'>زمینی ( نه شب) عادی/ سامرا</th>
									<td>نجف</td>
									<td>نجف</td>
									<td>نجف</td>
									<td>نجف</td>
									<td>کربلا</td>
									<td>کربلا</td>
									<td>کربلا</td>
									<td>کربلا</td>
									<td>زیارت سامرا/ اقامت کاظمین</td>
								</tr>
								<tr>
									<th scope='row'>زمینی ( هفت شب ) عکسی / سامرا</th>
									<td>کاظمین</td>
									<td>زیارت سامرا/ اقامت کربلا</td>
									<td>کربلا</td>
									<td>کربلا</td>
									<td>نجف</td>
									<td>نجف</td>
									<td>نجف</td>
									<td>-</td>
									<td>-</td>
								</tr>
								<tr>
									<th scope='row'>زمینی ( هفت شب ) عادی سامرا/ ابرار</th>
									<td>نجف</td>
									<td>نجف</td>
									<td>نجف</td>
									<td>کربلا</td>
									<td>کربلا</td>
									<td>کربلا</td>
									<td>زیارت سامرا/ اقامت کاظمین</td>
									<td>-</td>
									<td>-</td>
								</tr>
							</tbody>
						</table>
					</div>
				)
			}
		]
	},
	{
		category: 'ثبت نام زائران حج تمتع در کاروان های زیارتی',
		questions: [
			{
				id: 0,
				question: 'برای ثبت نام حج تمتع احتیاج به چه اطلاعاتی دارم؟',
				answer: (
					<div>
						<p>شما باید اطلاعات سند ودیعه گذاری و مشخصات فردی خود و همراهان را برای تشکیل گروه داشته باشید.</p>
					</div>
				)
			},
			{
				id: 1,
				question: 'اطلاعات من صحیح است ولی در سایت رزرو یافت نمیشود،چرا؟',
				answer: (
					<div>
						<p>
							با توجه به اینکه ثبت نامی تشرف به حج تمتع از سالهایی شروع شده که کدملی در اختیار همه نبوده است، اطلاعات فاقد مشخصات
							شناسنامه ای صحیح یا کدملی قابل رزرو از سایت نیستند و باید به دفاتر کارگزاری مراجعه کنند.
						</p>
					</div>
				)
			},
			{
				id: 2,
				question: 'چه مراحلی از اعزام حج تمتع از طریق سایت امکان پذیر است؟',
				answer: (
					<div>
						<p>رزرو کاروان مورد نظر و دریافت فرم معاینه پزشکی جهت مراجعه به پزشک کاروان</p>
					</div>
				)
			},
			{
				id: 3,
				question: 'آیا امکان بررسی اینکه اطلاعات من در بانک اطلاعاتی موجود است وجود دارد؟',
				answer: (
					<div>
						<p>
							بله، حتی در زمانی که عملیات حج در جریان نیست هر شخصی با در اختیار داشتن اطلاعات میتواند صحت امکان رزرو اینترنتی خود
							را کنترل کند.
						</p>
					</div>
				)
			},
			{
				id: 4,
				question: 'اطلاعات کاروانهای موجود و اولویتها و قیمتها را از کجا پیدا کنم؟',
				answer: (
					<div>
						<p>
							اطلاعات کاروانهای هر استان و اطلاعیه در مورد نوبت از طریق سایت دفتر هر استان از آدرس
							<a href='https://www.haj.ir' target='_blank' rel='noreferrer'>
								https://www.haj.ir
							</a>
							در دسترس است
						</p>
					</div>
				)
			},
			{
				id: 5,
				question: 'آیا امکان ثبت نام اینترنتی و پرداخت هزینه به وسیله آن مقدور می باشد؟',
				answer: (
					<div>
						<p>
							بله ، با مراجعه به سامانه
							<a href='https://reserve.haj.ir' target='_blank' rel='noreferrer'>
								reserve.haj.ir
							</a>
							امکان رزرو و پرداخت هزینه به صورت اینترنتی وجود دارد.
						</p>
					</div>
				)
			}
		]
	},
	{
		category: 'ثبت نام زائران عمره مفرده در کاروان های زیارتی',
		questions: [
			{
				id: 0,
				question: 'چگونه از انتخاب کاروان برای عمره مفرده اطلاع پیدا کنم؟',
				answer: (
					<div>
						<p>
							اطلاعات کاروانهای هر استان و اطلاعیه در مورد نوبت از طریق سایت دفتر هر استان از آدرس
							<a href='https://www.haj.ir/' target='_blank' rel='noreferrer'>
								www.haj.ir
							</a>
							در دسترس است.
						</p>
					</div>
				)
			},
			{
				id: 1,
				question: 'برای ثبت نام عمره مفرده احتیاج به چه اطلاعاتی دارم؟',
				answer: (
					<div>
						<p>
							شما باید اطلاعات سند ودیعه گذاری و مشخصات فردی خود و همراهان را برای تشکیل گروه داشته باشید. ضمن اینکه جهت تایید نام
							کاربری خود به یک شماره تلفن همراه احتیاج دارید. در این صورت با مراجعه به سامانه
							<a href='http://fakher.haj.ir/' target='_blank' rel='noreferrer'>
								fakher.haj.ir
							</a>
							می توانید نسبت به پیش ثبت نام اقدام نمائید .
						</p>
					</div>
				)
			},
			{
				id: 2,
				question: 'مدارك مورد نياز در ثبت نام حضوري چيست؟',
				answer: (
					<div>
						<p>اصل و كپي شناسنامه و كارت ملي كليه افراد ثبت نام كننده مورد نياز مي باشد.</p>
					</div>
				)
			},
			{
				id: 3,
				question: 'آیا برای تایید عملیات رزرو باید به دفاتر کارگزاری یا استان مراجعه کنم؟',
				answer: (
					<div>
						<p>
							خیر، تمام عملیات رزرو به صورت برخط و توسط خود شخص انجام میشود و پس از نهایی شدن رزرو باید برای تحویل مدارک به دفاتر
							کارگزاری مراجعه کنید.
						</p>
					</div>
				)
			},
			{
				id: 4,
				question: '5- آيا زمان ثبت نام تأثيري در اولويت اعزام دارد؟',
				answer: (
					<div>
						<p>خير. اعزام ها بر اساس قرعه كشي و بدون توجه به زمان ثبت نام صورت مي گيرد.</p>
					</div>
				)
			},
			{
				id: 5,
				question: 'شرايط سني ثبت نام در عمره مفرده چيست؟',
				answer: (
					<div>
						<p>ثبت نام عمره مفرده هيچ شرط سني ندارد.</p>
					</div>
				)
			},
			{
				id: 6,
				question: 'اگر نتوانستم در تاریخ مورد نظر خودم جای خالی پیدا کنم آیا شانس مجددی برای رزرو کاروان وجود دارد؟',
				answer: (
					<div>
						<p>
							بله، کاروانهای جدید به تناوب و بر اساس اطلاعیه سازمان اعلام میشوند ضمن اینکه در صورت انصراف افراد از تشرف، ظرفیت
							خالی در معرض رزرو عموم قرار میگیرد.
						</p>
					</div>
				)
			}
		]
	},
	{
		category: 'اعزام کارگزاران زیارتی',
		questions: [
			{
				id: 0,
				question: 'چگونه می توان بعنوان مدیر کاروان عتبات اعزام شد؟',
				answer: (
					<div>
						<p>
							جهت اعزام بعنوان مدیر کاروان عتبات بایستی در دوره های آموزشی مربوطه که توسط مرکز آموزش علمی کاربردی حج و زیارت استان
							برگزار میگردد شرکت نمائید.
						</p>
					</div>
				)
			},
			{
				id: 1,
				question: 'مدارک لازم جهت ثبت نام چیست؟',
				answer: (
					<div>
						<ul>
							<li>
								<em className='glyphicon glyphicon-check'></em>شناسنامه.
							</li>
							<li>
								<em className='glyphicon glyphicon-check'></em>کارت ملي.
							</li>
							<li>
								<em className='glyphicon glyphicon-check'></em>مدرک تحصيلي.
							</li>
							<li>
								<em className='glyphicon glyphicon-check'></em>مدرك تائيد محل سكونت.
							</li>
							<li>
								<em className='glyphicon glyphicon-check'></em>اصل آخرين حكم كارگزيني براي شاغلين دولتي.
							</li>
							<li>
								<em className='glyphicon glyphicon-check'></em>اصل حكم برقراري حقوق بازنشستگي براي افراد بازنشسته.
							</li>
							<li>
								<em className='glyphicon glyphicon-check'></em>گواهي سوابق ايثارگري. ( 1- سابقه حضور در جبهه هاي نبرد حق عليه باطل
								براساس گواهي نيروي مقاومت بسيج يا اداره عمليات وخدمات پرسنلي ستاد مشترك نيروهاي مسلح و يا اداره كل جهاد كشاورزي
								استان قابل قبول است. 2- سوابق آزادگی، جانبازی و خانواده¬ی شهید با ارایه¬ی کارت ایثارگری یا گواهی معتبر صادره از
								بنیاد شهید و امور ایثارگران، قابل قبول است.)
							</li>
							<li>
								<em className='glyphicon glyphicon-check'></em>كارت پايان خدمت و يا معافيت از خدمت.
							</li>
							<li>
								<em className='glyphicon glyphicon-check'></em>گواهي و يا مستندات مربوط به آندسته از سوابق زيارتي که تائيد نشده
								اند.
							</li>
						</ul>
					</div>
				)
			},
			{
				id: 2,
				question: 'چگونه از زمان ثبت نام آگاهی پیدا کنم؟',
				answer: (
					<div>
						<p>
							می توانید با مراجعه به سامانه
							<a href='http://kargozaran.haj.ir/' target='_blank' rel='noreferrer'>
								http://kargozaran.haj.ir
							</a>
							از فراخوانهای اعلام شده اطلاع به دست آورید.
						</p>
					</div>
				)
			}
		]
	},
	{
		category: 'ارائه خدمات بیمه ای به زائرین در کشور زیارتی',
		questions: [
			{
				id: 0,
				question: 'تعهدات بیمه در حج و عمره مفرده شامل چه مواردی می باشد؟',
				answer: (
					<div>
						<ul>
							<li>بیمه عمر، حوادث و درمان (سرمایه و تعهدات)</li>
							<li>بیمه مسئوليت (بار) تعهدات و پوششها</li>
						</ul>
					</div>
				)
			},
			{
				id: 1,
				question: 'تعهدات بیمه در عتبات عالیات شامل چه مواردی می باشد؟',
				answer: (
					<div>
						<p>بیمه عمر ، حادثه و درمان</p>
					</div>
				)
			},
			{
				id: 2,
				question: 'چگونه می توانم از جزئیات مربوط به بیمه اطلاع کسب کنم؟',
				answer: (
					<div>
						<p>
							با کلیک بر روی
							<a
								href='https://www.haj.ir/%D8%AE%D8%AF%D9%85%D8%A7%D8%AA/%D8%A8%DB%8C%D9%85%D9%87-%D9%88-%D8%B3%D9%84%D8%A7%D9%85%D8%AA'
								target='_blank'
								rel='noreferrer'>
								اینجا
							</a>
							می توانید از جزئیات تعهدات بیمه آگاه شوید.
						</p>
					</div>
				)
			},
			{
				id: 3,
				question: 'میزان پرداخت خسارت بار در عملیات حج تمتع چه قدراست؟',
				answer: (
					<div>
						<p>
							در عملیات حج تمتع سال 97 میزان خسارت پرداختی به بار زائرین در هنگام رفت 10.000.000 ریال و در زمان برگشت 20.000.000
							ریال بوده است.
						</p>
					</div>
				)
			},
			{
				id: 4,
				question: 'میزان پرداخت غرامت فوت به زائرین در عملیات حج تمتع چه قدراست؟',
				answer: (
					<div>
						<p>
							در عملیات حج تمتع سال 97، در صورت فوت به هر علت هر یک از زائرین غرامت فوت 200.000.000 ریال و در صورت فوت در اثر
							حادثه 2.500.000.000 ریال بوده است.
						</p>
					</div>
				)
			},
			{
				id: 5,
				question: 'میزان پرداخت هزینه های درمانی به زائرین در حج تمتع چه میزان بوده است؟',
				answer: (
					<div>
						<p>
							در عملیات حج تمتع سال 97 و در صورت بستری هر یک از زائرین در بیمارستانها و مراکز درمانی ایران حداکثر تا مبلغ
							200.000.000 ریال قابل پرداخت می باشد و در صورت انجام اقدامات درمانی سرپایی حداکثر مبلغ 20.000.000 ریال قابل پرداخت
							بوده است.
						</p>
					</div>
				)
			},
			{
				id: 6,
				question: 'مدت پوشش بیمه زائرین در عملیات حج تمتع چند روز می باشد؟',
				answer: (
					<div>
						<p>
							در عملیات حج تمتع سال 97 کلیه زائرین حج تمتع از 48 ساعت پیش از پرواز تا 72 ساعت پس از بازگشت تحت پوشش بیمه ای می
							باشند و در صورت بروز بیماری یا خادثه در عربستان و مراجعه به مراکز درمانی سعودی و ایران مستقر در آنجا و نیاز به ادامه
							درمان در ایران تا دو هفته پس از بازگشت تحت پوشش بیمه ای می باشند.
						</p>
					</div>
				)
			}
		]
	},
	{
		category: 'صدور مجوز فعالیت دفتر زیارتی',
		questions: [
			{
				id: 0,
				question: 'نحوه ثبت نام در سامانه جامع کارگزاران چگونه است؟',
				answer: (
					<div>
						<p>
							ابتدا باید وارد سایت
							<a href='https://kargozaran.haj.ir' target='_blank' rel='noreferrer'>
								https://kargozaran.haj.ir
							</a>
							شده و سپس وارد "صفحه شخصی" می شوید و بعد از آن روی گزینه "ثبت نام" کلیک کرده و تمامی اطلاعات را تکمیل نموده و برای
							تایید اطلاعات ثبت شده می بایست به همراه اصل مدارک و مستندات اطلاعات ثبتی به دفتر حج و زیارت استان محل سکونت خود
							مراجعه نمایید.
						</p>
					</div>
				)
			},
			{
				id: 1,
				question: ' نحوه ورود به حوزه کارگزاری حج و زیارت چگونه است؟',
				answer: (
					<div>
						<p>
							علاقه مندان ورود به این عرصه که حائز شرایط می باشند می توانند در فراخوان های معاونت آموزشی عتبات شرکت و پس از
							موافقیت در آزمون و مصاحبه و طی دوره آموزشی مربوطه، به منظور کسب تجربه میدانی و عملیاتی یک سفر به عنوان معاون آموزشی
							کاروان عتبات اعزام شوند و در صورت تایید عملکرد در لیست مدیران عتبات منظور و همچنین به فراخور ضوابط و مقررات مربوطه
							در فراخوان های مسئولیت های عمره و حج شرکت نمایند. انتخاب عوامل کاروان ها توسط مدیران و دفاتر زیارتی صورت می پذیرد.
						</p>
					</div>
				)
			},
			{
				id: 2,
				question: 'نحوه اخذ مجوز فعالیت خدمات زیارتی بند«پ» چگونه است؟',
				answer: (
					<div>
						<p>
							مجوز زیارتی بند پ براساس آیين نامه نظارت بر تاسيس و فعاليت دفترهاي خدمات مسافرتي، سياحتي، جهانگردي و زيارتي که طی
							شماره 14404 / ت 23203 هـ مورخ 5/4/1380 به تصویب هیات محترم وزیران رسیده است صادر می شود. متقاضی می بایست برای تشکیل
							پرونده و اقدامات مربوطه به دفتر حج و زیارت استان محل سکونت خود مراجعه نماید.
						</p>
					</div>
				)
			},
			{
				id: 3,
				question: 'دسترسی به اسامی و مشخصات دفاتر زیارتی دارای مجوز سازمان حج و زیارت چگونه است؟',
				answer: (
					<div>
						<p>
							اسامی و مشخصات دفاتر زیارتی فعال سطح کشور در سامانه جامع کارگزاران به آدرس زیر قابل مشاهده است:
							<a href='https://kargozaran.haj.ir/OfficeRelated/SearchOfficePublic.aspx' target='_blank' rel='noreferrer'>
								https://kargozaran.haj.ir/OfficeRelated/SearchOfficePublic.aspx
							</a>
						</p>
					</div>
				)
			},
			{
				id: 4,
				question: 'نحوه دسترسی به آخرین دستورالعمل های مربوط به کارگزاران و دفاتر خدمات زیارتی چگونه است؟',
				answer: (
					<div>
						<p>
							با مراجعه به سامانه جامع کارگزاران به آدرس
							<a href='https://kargozaran.haj.ir/Default.aspx' target='_blank' rel='noreferrer'>
								https://kargozaran.haj.ir/Default.aspx
							</a>
							می توانید از آخرین دستورالعمل ها و بخشنامه های حوزه کارگزاری حج و زیارت اطلاع حاصل نمایید.
						</p>
					</div>
				)
			}
		]
	},
	{
		category: 'تخصیص هتل به کاروان زیارتی',
		questions: [
			{
				id: 0,
				question: 'هتل ها در مکه و مدینه به چه تعداد اجاره می شود ؟',
				answer: (
					<div>
						<p>
							تعداد هتل ها بستگی به ظرفیت هتل های اجاره شده دارد به طور مثال در سال 98 برای 81000 زائر 78 هتل در مکه و 20 هتل در
							مدینه اجاره شده است .
						</p>
					</div>
				)
			},
			{
				id: 1,
				question: 'تعداد نفرات در اتاقها چند نفر است و آیا به صورت زوجی اسکان می یابند ؟',
				answer: (
					<div>
						<p>
							اسکان حجاج بصورت زوجی(خانوادگی) نبوده و اتاقها در مکه مکرمه حداقل 3 و 4 نفره و در مدینه حداقل 3 نفر حداکثر 5 نفر بر
							اساس متراژ اتاق ( هر نفر حدود 4 متر مربع) مورد استفاده قرار می گیرد.
						</p>
					</div>
				)
			},
			{
				id: 2,
				question: 'آیا در هتلها، مطب پزشک وجود دارد ؟',
				answer: (
					<div>
						<p>
							بله – معمولا در طبقات غیر مسکونی مانند میزانیه(طبقه بالای لابی- طبقه مشرف) و یا لابی محلی برای مطب در نظر گرفته می
							شود.
						</p>
					</div>
				)
			},
			{
				id: 3,
				question: 'مدت اقامت در مکه و مدینه چند روز می باشد ؟',
				answer: (
					<div>
						<p>در مدینه منوره حدوداً 5 روز(مدینه قبل شش روز) و در مکه مکرمه بر اساس برنامه پروازی از 20 تا30روز متغییر است.</p>
					</div>
				)
			},
			{
				id: 4,
				question: 'چه تعداد گروه قیمتی (درجه بندی)در مکه و مدینه وجود دارد ؟',
				answer: (
					<div>
						<p>در مکه مکرمه 7 گروه قیمتی و در مدینه منوره 5 گروه قیمتی</p>
					</div>
				)
			},
			{
				id: 5,
				question: 'زمان نظافت و تعویض ملحفه و شارژ اتاقها در مکه و مدینه چگونه است ؟',
				answer: (
					<div>
						<p>در مکه مکرمه هفته ای یک مرتبه و در مدینه منوره یکبار در ابتدای اسکان در هتل</p>
					</div>
				)
			},
			{
				id: 6,
				question: 'آب لوله کشی سرویسهای اتاقها و مکانهای عمومی هتل از نظر بهداشتی به چه صورت می باشد ؟',
				answer: (
					<div>
						<p>آب لوله کشی قابل شرب نبوده و فقط جهت استحمام و نظافت مورد استفاده قرار می گیرد.</p>
					</div>
				)
			},
			{
				id: 7,
				question: 'علت عدم تطابق هتل ها با وجود گروه قیمتی یکسان چیست ؟',
				answer: (
					<div>
						<p>
							به علت یکسان نبودن شرایط و امکانات ، هتل ها بر اساس امتیاز کسب شده به چند گروه قیمتی تقسیم می شوند که هر گروه شامل
							چند هتل با شرایط و امتیازات نزدیک به هم می باشند.
						</p>
					</div>
				)
			},
			{
				id: 8,
				question: 'آیا مکانی برای شستشو و خشک کردن لباسها در هتل ها وجود دارد ؟',
				answer: (
					<div>
						<p>بله – فضایی برای شستشو و خشک کردن لباسها در طبقات خدماتی هتل در نظر گرفته می شود.</p>
					</div>
				)
			},
			{
				id: 9,
				question: 'آیا امکان تمدید مدت اقامت در مدینه منوره وجود دارد ؟',
				answer: (
					<div>
						<p>به علت برنامه ای بودن پرواز ها و هتل ها که تاریخ دار اجاره می شوند این امکان وجود ندارد.</p>
					</div>
				)
			},
			{
				id: 10,
				question: 'نحوه محاسبه هزینه سفر زائرین و ارتباط آن با مسکن چگونه می باشد ؟',
				answer: (
					<div>
						<p>
							یکی از اصلی ترین آیتم های هزینه سفر ، هزینه اسکان می باشد که در کنار هزینه پرواز ، حمل و نقل ، تغذیه و تدارکات و ...
							هزینه سفر را تشکیل می دهد.
						</p>
					</div>
				)
			},
			{
				id: 11,
				question: 'آیا هتل ها از نظر خدمات دهی یکسان می باشند ؟',
				answer: (
					<div>
						<p>در سالهای اخیر خدمات یکسان شده و هتل ها به لحاظ ظرفیت ، عمر ساختمان، کیفیت و فاصله تا حرم متفاوت هستند.</p>
					</div>
				)
			},
			{
				id: 12,
				question: 'چرا هتلهای مدینه زمان اقامت محدود و ورود و خروج آن طبق تاریخ اعلام شده به زائر می باشد ؟',
				answer: (
					<div>
						<p>هتل های مدینه به صورت تاریخ دار اجاره شده و هر هتل به صورت دوره ای تا 7 مرحله مورد استفاده قرار می گیرد.</p>
					</div>
				)
			},
			{
				id: 13,
				question: 'جلسات کاروانها در کدام قسمت از هتل انجام می گیرد؟',
				answer: (
					<div>
						<p>معمولاً در سالن اجتماعات یا نماز خانه هتل</p>
					</div>
				)
			},
			{
				id: 14,
				question: 'دسترسی به حرم از هتل های مکه و مدینه چگونه است ؟',
				answer: (
					<div>
						<p>
							در مدینه منوره هتل ها نزدیک به حرم بوده و زائران پیاده به حرم مشرف می شوند اما در مکه مکرمه به وسیله اتوبوس به
							ایستگاه های اطراف حرم انتقال می یابند.
						</p>
					</div>
				)
			},
			{
				id: 15,
				question: 'آیا امکان سرو غذا در اتاقها وجود دارد ؟',
				answer: (
					<div>
						<p>خیر – غذا در رستوران و در ساعات معین سرو می گردد.</p>
					</div>
				)
			},
			{
				id: 16,
				question: 'آیا خدمات ارائه شده در هتل ها بر اساس ستاره آن می باشد ؟',
				answer: (
					<div>
						<p>
							خیر –در هتل ها خدمات بر اساس شرایط شهر های زیارتی و توافق انجام شده با مالک بصورت یکسان شامل تعویض ملحفه – نظافت
							دوره ای – شارژ اقلام بهداشتی مانند شامپو و صابون و.... می باشد . ضمناً غذای حجاج در آشپزخانه های متمرکز توسط آشپزهای
							ایرانی و با در نظر گرفتن ذائقه حجاج عزیز تهیه و بصورت گرم به هتل ها انتقال می یابد. همچنین اکثر اقلام تدارکاتی
							مانند: میوه ، آب آشامیدنی ، آب میوه و ... توسط سازمان حج و زیارت تامین و به هتل ها ارسال میگردد.
						</p>
					</div>
				)
			}
		]
	}
];

export const filteredFaqData: IFaqData[] = [
	{ category: mainFaqData[1].category, questions: [...mainFaqData[1].questions.slice(0, 3)] },
	mainFaqData[3],
	{ category: mainFaqData[5].category, questions: [...mainFaqData[5].questions.slice(0, 3)] }
];
